{"backend": "tensorflow", "config": [{"class_name": "Embedding", "config": {"trainable": true, "embeddings_regularizer": null, "name": "embedding_1", "output_dim": 256, "embeddings_constraint": null, "input_dim": 5000, "dtype": "float32", "input_length": 23, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "batch_input_shape": [null, 23], "activity_regularizer": null, "mask_zero": false}}, {"class_name": "Dropout", "config": {"rate": 0.5, "seed": null, "trainable": true, "noise_shape": null, "name": "dropout_1"}}, {"class_name": "LSTM", "config": {"return_sequences": false, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "unroll": false, "go_backwards": false, "recurrent_constraint": null, "use_bias": true, "dropout": 0.3, "activation": "tanh", "bias_regularizer": null, "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "return_state": false, "unit_forget_bias": true, "name": "lstm_1", "stateful": false, "recurrent_regularizer": null, "trainable": true, "bias_constraint": null, "implementation": 1, "recurrent_dropout": 0.3, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_activation": "hard_sigmoid", "units": 392}}, {"class_name": "Dense", "config": {"name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "trainable": true, "activation": "softmax", "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "units": 3}}], "keras_version": "2.1.3", "class_name": "Sequential"}